#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

module.demo.azurerm_resource_group.frontdoor: Refreshing state... [id=/subscriptions/78f26f10-0e60-4293-8a7e-122584ccb40d/resourceGroups/cq-frontdoor]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.demo.azurerm_frontdoor.test will be created
  + resource "azurerm_frontdoor" "test" {
      + backend_pool_health_probes                   = (known after apply)
      + backend_pool_load_balancing_settings         = (known after apply)
      + backend_pools                                = (known after apply)
      + backend_pools_send_receive_timeout_seconds   = 60
      + cname                                        = (known after apply)
      + enforce_backend_pools_certificate_name_check = false
      + explicit_resource_order                      = (known after apply)
      + frontend_endpoints                           = (known after apply)
      + header_frontdoor_id                          = (known after apply)
      + id                                           = (known after apply)
      + load_balancer_enabled                        = true
      + location                                     = (known after apply)
      + name                                         = "cq-frontdoor"
      + resource_group_name                          = "cq-frontdoor"
      + routing_rules                                = (known after apply)
      + tags                                         = {
          + "Environment" = "cq-provider-azure"
        }

      + backend_pool {
          + health_probe_name   = "exampleHealthProbeSetting1"
          + id                  = (known after apply)
          + load_balancing_name = "exampleLoadBalancingSettings1"
          + name                = "exampleBackendBing"

          + backend {
              + address     = "www.bing.com"
              + enabled     = true
              + host_header = "www.bing.com"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }

      + backend_pool_health_probe {
          + enabled             = true
          + id                  = (known after apply)
          + interval_in_seconds = 120
          + name                = "exampleHealthProbeSetting1"
          + path                = "/"
          + probe_method        = "GET"
          + protocol            = "Http"
        }

      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + id                              = (known after apply)
          + name                            = "exampleLoadBalancingSettings1"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }

      + frontend_endpoint {
          + host_name                    = "cq-frontdoor.azurefd.net"
          + id                           = (known after apply)
          + name                         = "cq-frontdoor"
          + session_affinity_enabled     = false
          + session_affinity_ttl_seconds = 0
        }

      + routing_rule {
          + accepted_protocols = [
              + "Http",
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "cq-frontdoor",
            ]
          + id                 = (known after apply)
          + name               = "exampleRoutingRule1"
          + patterns_to_match  = [
              + "/*",
            ]

          + forwarding_configuration {
              + backend_pool_name                     = "exampleBackendBing"
              + cache_enabled                         = false
              + cache_query_parameter_strip_directive = "StripAll"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "MatchRequest"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pusher: @candiduslynx, Action: `pull_request_target`, Working Directory: ``, Workflow: `terraform_plan`*